export enum Elements {
    金 = "金",
    木 = "木",
    水 = "水",
    火 = "火",

    土 = "土"

}

export enum ThreeTalentsType {
    "天" = "天",
    "地" = "地",
    "人" = "人"
}

export enum ThreeTalentsIntentType {
    "总评" = "总评",
    "总论" = "总论",
    "性格" = "性格",
    "意志" = "意志",
    "事业" = "事业",
    "家庭" = "家庭",
    "婚姻" = "婚姻",
    "子女" = "子女",
    "社交" = "社交",
    "精神" = "精神",
    "财运" = "财运",
    "健康" = "健康",
    "老运" = "老运"
}
export enum FiveCaseName {
    /**
     * 天格数理 又称先格，是祖先留下来的，对人生影响不大
     */
    "天" = "天格",
    /**
     * 人格数理 又称主格，是姓名的中心点，主管人一生命运
     */
    "地" = "地格",
    /**
     * 地格数理 又称前运，是前半生的命运，会影响中年以前
     */
    "人" = "人格",
    /**
     * 总格数理 又称后运，是后半生的命运，影响中年到老年
     */
    "总" = "总格",
    /**
     * 外格数理 又称灵运，主管命运之灵力、社交能力和智慧
     */
    "外" = "外格"
}
